{
  "API key not configured. Check your settings.": "Clave API no configurada. Verifique su configuración.",
  "Change applied successfully.": "Cambio aplicado exitosamente.",
  "Change rejected/discarded.": "Cambio rechazado/descartado.",
  "Change not found or expired.": "Cambio no encontrado o expirado.",
  "Could not determine change ID to apply.": "No se pudo determinar el ID del cambio a aplicar.",
  "No active editor found": "No se encontró un editor activo",
  "No active editor to insert code into.": "No hay editor activo para insertar código.",
  "No workspace folder open": "No hay carpeta de espacio de trabajo abierta",
  "No workspace folder open.": "No hay carpeta de espacio de trabajo abierta.",
  "No workspace open": "No hay espacio de trabajo abierto",
  "No workspace open.": "No hay espacio de trabajo abierto.",
  "Invalid API key. Please update your API key": "Clave API inválida. Por favor actualice su clave API",
  "Rate limiting error, try again later": "Error de límite de velocidad, intente más tarde",
  "select a piece of code.": "seleccione un fragmento de código.",
  "model not reponding, try again later": "el modelo no responde, intente más tarde",
  "Provider not initialized": "Proveedor no inicializado",
  "An error occurred while creating the model. Please try again.": "Ocurrió un error al crear el modelo. Por favor intente de nuevo.",
  "An error occurred while generating the response. Please try again.": "Ocurrió un error al generar la respuesta. Por favor intente de nuevo.",
  "No text selected": "No hay texto seleccionado",
  "Selection is not a valid URL": "La selección no es una URL válida",
  "No error or code selected to fix.": "No se seleccionó error o código para corregir.",
  "CodeBuddy: Fix applied successfully!": "CodeBuddy: ¡Corrección aplicada exitosamente!",
  "CodeBuddy: Could not auto-fix. Opening chat for details.": "CodeBuddy: No se pudo corregir automáticamente. Abriendo chat para más detalles.",
  "Failed to get staged changes. Please ensure you have staged changes.": "No se pudieron obtener los cambios preparados. Asegúrese de tener cambios preparados.",
  "Please open a workspace to generate documentation.": "Por favor abra un espacio de trabajo para generar documentación.",
  "No documentation found. Would you like to generate it?": "No se encontró documentación. ¿Desea generarla?",
  "Failed to open documentation": "No se pudo abrir la documentación",
  "Content added to chat context": "Contenido agregado al contexto del chat",
  "Summarizing article...": "Resumiendo artículo...",
  "Failed to add content to chat": "No se pudo agregar contenido al chat",
  "Failed to summarize article": "No se pudo resumir el artículo",
  "Project rules file created! Edit it to customize AI behavior.": "¡Archivo de reglas del proyecto creado! Edítelo para personalizar el comportamiento de IA.",
  "No project rules file found. Would you like to create one?": "No se encontró archivo de reglas del proyecto. ¿Desea crear uno?",
  "Project rules exceeded token limit and were truncated. Consider reducing rules content.": "Las reglas del proyecto excedieron el límite de tokens y fueron truncadas. Considere reducir el contenido.",
  "Codebase analysis cache cleared successfully": "Caché de análisis de código limpiado exitosamente",
  "Are you sure you want to clear the codebase analysis cache? This will require re-analysis next time.": "¿Está seguro de que desea limpiar el caché de análisis de código? Esto requerirá re-análisis la próxima vez.",
  "Analysis refresh cancelled": "Actualización de análisis cancelada",
  "Are you sure you want to restart the CodeBuddy extension?": "¿Está seguro de que desea reiniciar la extensión CodeBuddy?",
  "Failed to restart extension. Please reload VS Code manually.": "No se pudo reiniciar la extensión. Por favor recargue VS Code manualmente.",
  "No files found to index.": "No se encontraron archivos para indexar.",
  "Vector database configuration reset to defaults": "Configuración de base de datos vectorial restablecida",
  "Vector database configuration updated successfully!": "¡Configuración de base de datos vectorial actualizada exitosamente!",
  "Configuration imported successfully": "Configuración importada exitosamente",
  "Failed to reset configuration": "No se pudo restablecer la configuración",
  "Failed to update configuration": "No se pudo actualizar la configuración",
  "Failed to auto-tune configuration": "No se pudo auto-configurar",
  "Failed to import configuration: Invalid JSON": "No se pudo importar la configuración: JSON inválido",
  "Configuration is already optimal for current performance metrics": "La configuración ya es óptima para las métricas de rendimiento actuales",
  "Configuration manager not available": "Administrador de configuración no disponible",
  "CodeBuddy: Morning tech news arrived! ☕": "CodeBuddy: ¡Noticias tecnológicas de la mañana! ☕",
  "CodeBuddy: Afternoon tech news update! 🌇": "CodeBuddy: ¡Actualización de noticias de la tarde! 🌇",
  "CodeBuddy: Evening tech news update! 🌙": "CodeBuddy: ¡Actualización de noticias de la noche! 🌙",
  "Error processing user query": "Error al procesar la consulta del usuario",
  "token usage or billing issues, kindly check your billing information on your AI platform": "problemas de uso de tokens o facturación, revise su información de facturación en su plataforma de IA",
  "CodeBuddy resumed from emergency stop": "CodeBuddy reanudado desde parada de emergencia",
  "No other branches found to compare against.": "No se encontraron otras ramas para comparar.",
  "Could not detect any Git changes. The review might be less accurate.": "No se pudieron detectar cambios de Git. La revisión podría ser menos precisa.",
  "Please make sure that you have selected a valid model with correct API key in the settings.": "Asegúrese de haber seleccionado un modelo válido con la clave API correcta en la configuración.",
  "Enter URL to open in Smart Reader": "Ingrese URL para abrir en Lector Inteligente",
  "Enter URL to open": "Ingrese URL para abrir",
  "Confirm branch name": "Confirmar nombre de rama",
  "Opening Reader Mode...": "Abriendo Modo Lector...",
  "Indexing Workspace (Background Worker)": "Indexando Espacio de Trabajo (Trabajador en Segundo Plano)",
  "Analyzing codebase to answer your question...": "Analizando código para responder su pregunta...",
  "CodeBuddy: Attempting to auto-fix error...": "CodeBuddy: Intentando corregir error automáticamente...",
  "Generating Intelligent Documentation...": "Generando Documentación Inteligente...",
  "Refreshing codebase analysis...": "Actualizando análisis de código...",
  "Restarting CodeBuddy...": "Reiniciando CodeBuddy...",
  "Yes": "Sí",
  "No": "No",
  "Cancel": "Cancelar",
  "Create File": "Crear Archivo",
  "Refresh": "Actualizar",
  "Use Existing": "Usar Existente",
  "Generate": "Generar"
}
