{
  "API key not configured. Check your settings.": "Clé API non configurée. Vérifiez vos paramètres.",
  "Change applied successfully.": "Changement appliqué avec succès.",
  "Change rejected/discarded.": "Changement rejeté/annulé.",
  "Change not found or expired.": "Changement non trouvé ou expiré.",
  "Could not determine change ID to apply.": "Impossible de déterminer l'ID du changement à appliquer.",
  "No active editor found": "Aucun éditeur actif trouvé",
  "No active editor to insert code into.": "Aucun éditeur actif pour insérer du code.",
  "No workspace folder open": "Aucun dossier d'espace de travail ouvert",
  "No workspace folder open.": "Aucun dossier d'espace de travail ouvert.",
  "No workspace open": "Aucun espace de travail ouvert",
  "No workspace open.": "Aucun espace de travail ouvert.",
  "Invalid API key. Please update your API key": "Clé API invalide. Veuillez mettre à jour votre clé API",
  "Rate limiting error, try again later": "Erreur de limitation de débit, réessayez plus tard",
  "select a piece of code.": "sélectionnez un morceau de code.",
  "model not reponding, try again later": "le modèle ne répond pas, réessayez plus tard",
  "Provider not initialized": "Fournisseur non initialisé",
  "An error occurred while creating the model. Please try again.": "Une erreur s'est produite lors de la création du modèle. Veuillez réessayer.",
  "An error occurred while generating the response. Please try again.": "Une erreur s'est produite lors de la génération de la réponse. Veuillez réessayer.",
  "No text selected": "Aucun texte sélectionné",
  "Selection is not a valid URL": "La sélection n'est pas une URL valide",
  "No error or code selected to fix.": "Aucune erreur ou code sélectionné à corriger.",
  "CodeBuddy: Fix applied successfully!": "CodeBuddy : Correction appliquée avec succès !",
  "CodeBuddy: Could not auto-fix. Opening chat for details.": "CodeBuddy : Impossible de corriger automatiquement. Ouverture du chat pour plus de détails.",
  "Failed to get staged changes. Please ensure you have staged changes.": "Impossible d'obtenir les changements indexés. Assurez-vous d'avoir des changements indexés.",
  "Please open a workspace to generate documentation.": "Veuillez ouvrir un espace de travail pour générer la documentation.",
  "No documentation found. Would you like to generate it?": "Aucune documentation trouvée. Voulez-vous la générer ?",
  "Failed to open documentation": "Impossible d'ouvrir la documentation",
  "Content added to chat context": "Contenu ajouté au contexte du chat",
  "Summarizing article...": "Résumé de l'article en cours...",
  "Failed to add content to chat": "Impossible d'ajouter le contenu au chat",
  "Failed to summarize article": "Impossible de résumer l'article",
  "Project rules file created! Edit it to customize AI behavior.": "Fichier de règles du projet créé ! Modifiez-le pour personnaliser le comportement de l'IA.",
  "No project rules file found. Would you like to create one?": "Aucun fichier de règles du projet trouvé. Voulez-vous en créer un ?",
  "Project rules exceeded token limit and were truncated. Consider reducing rules content.": "Les règles du projet ont dépassé la limite de tokens et ont été tronquées. Envisagez de réduire le contenu.",
  "Codebase analysis cache cleared successfully": "Cache d'analyse du code source effacé avec succès",
  "Are you sure you want to clear the codebase analysis cache? This will require re-analysis next time.": "Êtes-vous sûr de vouloir effacer le cache d'analyse ? Une réanalyse sera nécessaire la prochaine fois.",
  "Analysis refresh cancelled": "Actualisation de l'analyse annulée",
  "Are you sure you want to restart the CodeBuddy extension?": "Êtes-vous sûr de vouloir redémarrer l'extension CodeBuddy ?",
  "Failed to restart extension. Please reload VS Code manually.": "Impossible de redémarrer l'extension. Veuillez recharger VS Code manuellement.",
  "No files found to index.": "Aucun fichier trouvé à indexer.",
  "Vector database configuration reset to defaults": "Configuration de la base de données vectorielle réinitialisée",
  "Vector database configuration updated successfully!": "Configuration de la base de données vectorielle mise à jour avec succès !",
  "Configuration imported successfully": "Configuration importée avec succès",
  "Failed to reset configuration": "Impossible de réinitialiser la configuration",
  "Failed to update configuration": "Impossible de mettre à jour la configuration",
  "Failed to auto-tune configuration": "Impossible d'auto-configurer",
  "Failed to import configuration: Invalid JSON": "Impossible d'importer la configuration : JSON invalide",
  "Configuration is already optimal for current performance metrics": "La configuration est déjà optimale pour les métriques de performance actuelles",
  "Configuration manager not available": "Gestionnaire de configuration non disponible",
  "CodeBuddy: Morning tech news arrived! ☕": "CodeBuddy : Les actualités tech du matin sont arrivées ! ☕",
  "CodeBuddy: Afternoon tech news update! 🌇": "CodeBuddy : Mise à jour des actualités tech de l'après-midi ! 🌇",
  "CodeBuddy: Evening tech news update! 🌙": "CodeBuddy : Mise à jour des actualités tech du soir ! 🌙",
  "Error processing user query": "Erreur lors du traitement de la requête utilisateur",
  "token usage or billing issues, kindly check your billing information on your AI platform": "problèmes d'utilisation de tokens ou de facturation, veuillez vérifier vos informations de facturation sur votre plateforme IA",
  "CodeBuddy resumed from emergency stop": "CodeBuddy a repris après l'arrêt d'urgence",
  "No other branches found to compare against.": "Aucune autre branche trouvée pour la comparaison.",
  "Could not detect any Git changes. The review might be less accurate.": "Impossible de détecter des changements Git. La revue pourrait être moins précise.",
  "Please make sure that you have selected a valid model with correct API key in the settings.": "Assurez-vous d'avoir sélectionné un modèle valide avec la bonne clé API dans les paramètres.",
  "Enter URL to open in Smart Reader": "Entrez l'URL à ouvrir dans le lecteur intelligent",
  "Enter URL to open": "Entrez l'URL à ouvrir",
  "Confirm branch name": "Confirmer le nom de la branche",
  "Opening Reader Mode...": "Ouverture du mode lecteur...",
  "Indexing Workspace (Background Worker)": "Indexation de l'espace de travail (tâche de fond)",
  "Analyzing codebase to answer your question...": "Analyse du code source pour répondre à votre question...",
  "CodeBuddy: Attempting to auto-fix error...": "CodeBuddy : Tentative de correction automatique...",
  "Generating Intelligent Documentation...": "Génération de documentation intelligente...",
  "Refreshing codebase analysis...": "Actualisation de l'analyse du code source...",
  "Restarting CodeBuddy...": "Redémarrage de CodeBuddy...",
  "Yes": "Oui",
  "No": "Non",
  "Cancel": "Annuler",
  "Create File": "Créer un fichier",
  "Refresh": "Actualiser",
  "Use Existing": "Utiliser l'existant",
  "Generate": "Générer"
}
